22-rails-cookies/app/controllers/application_controller.rb

  def display_nacho_cart
    # get the nachos with the cart and pass to controller to send to view
    @cart_items = Nacho.find(cart)
---
SELECT  "nachos".* FROM "nachos" WHERE "nachos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]