23-rails-auth/app/controllers/application_controller.rb

  def current_user
    # find_by will give me nil
    # nil is falsey
    # User.find will error out if ther is no user
    User.find_by(id: session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]