23-rails-auth/app/controllers/users_controller.rb

  def create #POST request to /users FOR SIGNUP
    @user = User.create(user_params) # User.create is a method on our MODEL which will encrypt and store the user's plaintext password
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)